<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Default Laravel Validation Language Lines (رسائل التحقق الافتراضية)
    |--------------------------------------------------------------------------
    |
    | تحتوي السطور التالية على رسائل الخطأ الافتراضية المستخدمة بواسطة 
    | فئة التحقق (validator) في Laravel. بعض هذه القواعد لها إصدارات متعددة مثل
    | قواعد الحجم (size). لا تتردد في تعديل كل من هذه الرسائل هنا.
    |
    */
    'file' => 'يجب أن يكون حقل :attribute ملفاً.',
    'image' => 'يجب أن يكون حقل :attribute صورة.',
    'required' => 'حقل :attribute مطلوب.',
    'max' => [
        'array' => 'يجب ألا يحتوي حقل :attribute على أكثر من :max عنصر/عناصر.',
        'file' => 'يجب ألا يتجاوز حجم حقل :attribute :max كيلوبايت.',
        'numeric' => 'يجب ألا يكون حقل :attribute أكبر من :max.',
        'string' => 'يجب ألا يتجاوز طول حقل :attribute :max حرفاً/أحرف.',
    ],
    'mimes' => 'يجب أن يكون حقل :attribute ملفاً من نوع: :values.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines (رسائل التحقق المخصصة)
    |--------------------------------------------------------------------------
    |
    | هنا يمكنك تحديد رسائل تحقق مخصصة للخصائص باستخدام اصطلاح
    | "attribute.rule" لتسمية السطور. هذا يجعل من السريع
    | تحديد سطر لغة مخصص لقاعدة معينة.
    |
    */

    'custom' => [],

];